---
kind: type
id: T:Autodesk.Revit.DB.IFC.IFCRange
source: html/dd18e556-a0d8-7bbb-1522-518d8a82736f.htm
---
# Autodesk.Revit.DB.IFC.IFCRange

Typically for IFC export, this represents the lower and upper elevations for split wall and column geometry.

## Syntax (C#)
```csharp
public class IFCRange : IDisposable
```

## Remarks
It contains two double values representing the starting and ending values as a range.